Revit 2017 API
TextNote.SetFormattedText Method
 Sets the text and associated formatting of the text of in this text note with a given FormattedText object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2017
Syntax
C#
public void SetFormattedText(
	FormattedText formattedText
)
Visual Basic
Public Sub SetFormattedText ( _
	formattedText As FormattedText _
)
Visual C++
public:
void SetFormattedText(
	FormattedText^ formattedText
)
Parameters
formattedText
Type: Autodesk.Revit.DB.FormattedText
 The FormattedText object containing the text and associated formatting of the text.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
TextNote Class
Autodesk.Revit.DB Namespace